[{"id": "intro-quiz-0", "description": "¿En cuál de estos enfoques se prioriza la encapsulación, la herencia y el polimorfismo en el diseño del código?", "leftOption": "Programación orientada a objetos", "rightOption": "Programación estructurada", "image": "quiz.jfif"}, {"id": "intro-quiz-1", "description": "¿Cuál de estos métodos de búsqueda de un elemento en una lista es más eficiente?", "leftOption": "Búsqueda lineal", "rightOption": "Búsqueda binaria", "image": "quiz.jfif"}, {"id": "intro-quiz-2", "description": "¿De cuál de estos teoremas se deduce el Teorema de Rolle?", "leftOption": "Teorema de Fermat", "rightOption": "Teorema de Lagrange", "image": "quiz.jfif"}, {"id": "intro-quiz-3", "description": "¿Cuál de estos métodos es especialmente útil para ajustar una curva a un conjunto de datos observados?", "leftOption": "Mínimos cuadrados", "rightOption": "Polinomios de Taylor", "image": "quiz.jfif"}, {"id": "intro-quiz-4", "description": "¿Qué teorema matemático se utiliza para facilitar el cálculo de flujo vectorial a través de una superficie cerrada?", "leftOption": "Teorema de Stonks", "rightOption": "Teorema de Gauss", "image": "quiz.jfif"}, {"id": "intro-quiz-5", "description": "Dados dos vértices u y v de un árbol enraizado. ¿Qué proposición es equivalente a afirmar que existe un camino que empieza en v y acaba en u?", "leftOption": "v es padre de u", "rightOption": "u es descendiente de v", "image": "quiz.jfif"}, {"id": "intro-quiz-6", "description": "¿Qué instrumento se utiliza en un experimento para verificar la Ley de Boyle-Mariotte?", "leftOption": "Manómetro", "rightOption": "No sé, man. Soy de sistemas", "image": "quiz.jfif"}, {"id": "intro-resultado-0", "description": "Un resultado desastroso. No has acertado ni una sola respuesta en el cuestionario. Te preguntas cómo puedes ser tan ignorante. Siento pena por ti. No es una situación que debas tomar a la ligera.<br><br>Decides ir a buscar algo para tomar.", "leftOption": "Café", "rightOption": "Mate", "image": "fin_cuestionario.jfif"}, {"id": "intro-resultado-1", "description": "¿Solo una respuesta correcta de siete? Me daría vergüenza… Claramente, tus conocimientos están lejos de ser sólidos. Esta es una llamada de atención para que te tomes en serio tu formación y te comprometas a mejorar. ¡Ponte a estudiar, maldita sea!<br><br>Decides ir a buscar algo para tomar.", "leftOption": "Café", "rightOption": "Mate", "image": "fin_cuestionario.jfif"}, {"id": "intro-resultado-2", "description": "Felicidades. Tienes más cultura que un recién nacido, pero no mucha más. Podría haber acertado más preguntas eligiendo al azar. En fin, no puedo decir que estoy decepcionado, ya que no esperaba nada de ti.<br><br>Decides ir a buscar algo para tomar.", "leftOption": "Café", "rightOption": "Mate", "image": "fin_cuestionario.jfif"}, {"id": "intro-resultado-3", "description": "¿No pudiste responder siete preguntas correctamente? Y eso que eran sencillas... No está tan mal, pero no es motivo de celebración. Ni muy listo, ni muy tonto.<br><br>Decides ir a buscar algo para tomar.", "leftOption": "Café", "rightOption": "Mate", "image": "fin_cuestionario.jfif"}, {"id": "intro-resultado-4", "description": "Parece que tuviste suerte esta vez, pero no te confíes. La suerte no golpea dos veces a la misma puerta.<br><br>Decides ir a buscar algo para tomar.", "leftOption": "Café", "rightOption": "Mate", "image": "fin_cuestionario.jfif"}, {"id": "cafe", "description": "Café, la bebida de los dioses. O eso dicen... Lo cierto es que no te gusta el café. Por lo menos no la porquería de café instantáneo que compraste. Pero no te queda otra opción, así que preparas una taza.<br><br>El café se disuelve en el agua caliente, liberando un aroma a café quemado que llena la cocina. El olor, aunque familiar, no logra disipar tu desconfianza en la mezcla.", "leftOption": "Tomar el café solo", "rightOption": "Agregarle leche", "image": "cafe.jfif"}, {"id": "chad-cafe-solo", "description": "\"Con huevo\" te dices a ti mismo. Acto seguido, le das el primer sorbo al café y degustas su sabor amargo y asqueroso. \"No puedo desperdiciar el café\" continúas con una mezcla de resignación y determinación. Tras cada sorbo, sientes cómo la amargura se adueña de tu lengua y el café castiga tu paladar.", "leftOption": "...", "rightOption": "...", "image": "chad-cafe-solo.jfif"}, {"id": "ducha-0", "description": "Tras terminar el café, notas que tu corazón late de forma acelerada. Una gota de sudor desciende por tu frente, testigo silencioso de la hazaña que acabas de lograr.<br><br>Decides que mereces una ducha como recompensa por tu sangre fría, pero te llevas una gran decepción al descubrir que no tienes agua caliente.", "leftOption": "Llamar al dueño del edificio", "rightOption": "Tomar una ducha fría", "image": "ducha.jfif"}, {"id": "telefono-0", "description": "Te sientes indignado por la falta de agua caliente y decides llamar al dueño del apartamento para reclamarle. Esperas unos segundos hasta que te contesta una voz agresiva.<br><br>\"¿Qué?\" te contesta el dueño con evidente molestia, sin esperar mucho de esta llamada intempestiva.", "leftOption": "Soy yo, <i>man</i>", "rightOption": "So", "image": "telefono.jfif"}, {"id": "telefono-01", "description": "\"¡Tell me what you want!\" te increpa el dueño con impaciencia.", "leftOption": "No tengo agua caliente", "rightOption": "I don't have hot water", "image": "telefono.jfif"}, {"id": "telefono-02", "description": "\"Me suda la polla\" te contesta el dueño, dejándote momentáneamente paralizado ante su falta de empatía.", "leftOption": "Me tenés que ayudar", "rightOption": "Dejá de hacerte el boludo", "image": "telefono.jfif"}, {"id": "telefono-03", "description": "\"¡Es culpa tuya!\" reacciona con indignación. \"No me eches a mí la culpa\". Sientes como la temperatura de tu cuerpo se eleva a medida que la discusión se intensifica.", "leftOption": "Es tu edificio, hacete cargo", "rightOption": "Me lo vas a descontar del alquiler", "image": "telefono.jfif"}, {"id": "telefono-04", "description": "\"¡Qué quieres que haga!\" te exige, mientras tu cuerpo continúa absorbiendo el calor de su ambiente.", "leftOption": "Solucioname el tema del agua", "rightOption": "Tu servicio es desproporcional al precio", "image": "telefono.jfif"}, {"id": "telefono-05", "description": "\"¡No quiero!\" es su contendente respuesta. La temperatura del aire de la habitación cae por debajo de los 0 grados, mientras que el equilibrio térmico con tu cuerpo continúa alejándose.", "leftOption": "¡Dale, gordo!", "rightOption": "Cortar", "image": "telefono.jfif"}, {"id": "telefono-06", "description": "\"Joder\" grita con resignación. Finalmente, cede ante tu demanda. \"Voy a mandar a alguien a revisarlo, pero no esperes que sea rápido. Tengo muchas cosas que hacer\". Seguidamente corta el teléfono.<br><br>Felicidades, lo lograste. ¿Qué harás mientras esperas al sujeto?", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "telefono.jfif"}, {"id": "llaman-puerta-0", "description": "El estado de trance en el que te hallabas se quiebra abruptamente al escuchar un llamado proveniente de la puerta principal. Supones que debe ser la persona que resolverá el problema del agua. Aunque la voz suena familiar, no logras identificar a quién pertenece.", "leftOption": "Abrir", "rightOption": "Abrir, no me queda otra", "image": "puerta-cerrada.jpeg"}, {"id": "llaman-puerta-1", "description": "Cuando sientes el frío del picaporte, una oleada de terror recorre tu cuerpo. No hay motivos para desconfiar, pero un presentimiento desagradable se apodera de ti. Aún así, recuerdas que has pasado por momentos más difíciles, como el final de Análisis Matemático 1.<br><br>Con cautela, abres la puerta...", "leftOption": "...", "rightOption": "...", "image": "picaporte.jpeg"}, {"id": "llaman-puerta-2", "description": "En el umbral de la puerta, una figura sombría te observa con una sonrisa siniestra. Conoces a esta persona, aunque preferirías no recordarla. Es el profesor de Paradigmas de la Programación, el mismo que te reprobó en dos ocasiones.<br><br>Una sensación escalofriante se apodera de ti al verlo. ¿Qué demonios hace aquí el profesor? Tu mente trabaja a toda velocidad en busca de respuestas, pero antes de que puedas formular una pregunta, el profesor te lanza una mirada intensa y plantea una pregunta con tono ominoso: \"¿Cuál es el mejor lenguaje de programación?\" Su autoridad se impone sobre ti, y sientes la urgencia de responder", "leftOption": "Pascal", "rightOption": "Wollok", "image": "profe-puerta.jfif"}, {"id": "telefono-16", "description": "Has agotado tu paciencia y decides poner fin a la llamada. Canalizas toda la energía térmica adquirida durante la discusión en un golpe contra el pobre aparato telefónico. La fuerza ejercida es tal que supera incluso las limitaciones establecidas por la segunda ley de la termodinámica, provocando una ruptura en la simulación. Este es el fin de tu historia.", "leftOption": "Fin", "rightOption": "Fin", "image": "black.jpg"}, {"id": "telefono-15", "description": "\"Lo que no tengo proporcional es la polla, que la tengo *muy* pequeña.\" son sus últimas palabras antes de cortar la llamada.<br><br>Mientras terminas de procesar lo que acabas de escuchar, ¿por qué no aprovechas para ponerte al día con alguna de tus tareas pendientes?", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "telefono.jfif"}, {"id": "intro-quiz2", "description": "Decides que tus responsabilidades académicas deben ocupar el primer lugar en tu lista de prioridades. Te desplazas hasta tu escritorio, donde aguarda una montaña de apuntes y libros, testigos silenciosos de las horas de estudio que te esperan.<br><br>El mundo exterior desaparece a medida que te sumerges en tu tarea, recordando la importancia de este examen para tu futuro académico.", "leftOption": "...", "rightOption": "...", "image": "escritorio.jfif"}, {"id": "quiz2-0", "description": "¿Cuál es el elemento neutro de la multiplicación de los números complejos?", "leftOption": "1+i", "rightOption": "1", "image": "escritorio.jfif"}, {"id": "quiz2-1", "description": "¿Cuándo converge la serie p?", "leftOption": "Cuando p >= 1", "rightOption": "Cuando p < 1", "image": "escritorio.jfif"}, {"id": "quiz2-2", "description": "¿Cuál es la contrapositiva de la proposición p --> q?", "leftOption": "-p --> -q", "rightOption": "-q --> -p", "image": "escritorio.jfif"}, {"id": "quiz2-3", "description": "Si a y m son coprimos, entonces a elevada a, la cantidad de números entre 0 y m coprimos con m, es congruente con 1 módulo m. ¿Cómo se llama este teorema?", "leftOption": "Teorema de Euler-Fermat", "rightOption": "Pequeño teorema de Fermat", "image": "escritorio.jfif"}, {"id": "quiz2-caca", "description": "¿Quieres que te haga caca en la cara?", "leftOption": "Si", "rightOption": "No", "image": "escritorio.jfif"}, {"id": "suena-telefono-0", "description": "El sonido agudo de un teléfono rompe el silencio de tu departamento. El timbre insiste en llamar tu atención, como si te recordara que el mundo exterior sigue existiendo. No hay razón para no contestar, ¿verdad?", "leftOption": "No, no la hay", "rightOption": "Me da paja", "image": "telefono-1.jfif"}, {"id": "contesta-telefono-0", "description": "Cuando finalmente te dignas a contestar el teléfono, no oyes nada. \"¿Hola?\" preguntas con cierta impaciencia. Del otro lado de la línea, una voz familiar te llega, con tono abatido. \"Me he dejado las llaves dentro...\" dice el dueño del edificio al borde del llanto, implorando clemencia.", "leftOption": "Jajajjajaaja", "rightOption": "xDDDDD", "image": "telefono.jfif"}, {"id": "contesta-telefono-1", "description": "\"¡No es gracioso!\" interviene rápidamente. Como siempre, tienes dos opciones. ¿Lo ayudas o lo dejas a su suerte?", "leftOption": "Apiadarte del pobre infeliz", "rightOption": "¡Que se cague por gil!", "image": "telefono.jfif"}, {"id": "contesta-telefono-apiadarse-0", "description": "\"Gracias por escuchar mis plegarias, tío.\" exclama con genuina gratitud. Das por hecho que el tema del agua estará solucionado al cabo de unos días.", "leftOption": "...", "rightOption": "...", "image": "telefono.jfif"}, {"id": "contesta-telefono-apiadarse-1", "description": "Habiendo realizado la buena acción del día, decides que es momento de ir a dormir.", "leftOption": "...", "rightOption": "...", "image": "cama.jfif"}, {"id": "contesta-telefono-que-se-cague-0", "description": "\"¡Me cago en tus muertos!\" se oye desde la ventana. Por una vez, el karma parece funcionar y la realidad imparte justicia.", "leftOption": "...", "rightOption": "...", "image": "telefono.jfif"}, {"id": "contesta-telefono-que-se-cague-1", "description": "Con la satisfacción provocada por cómo se han desarrollado las cosas, decides que es hora de retirarte a descansar.", "leftOption": "...", "rightOption": "...", "image": "cama.jfif"}, {"id": "suena-telefono-1", "description": "\"Eres un vago de mierda\" oyes de repente. ¿Será tu cabeza haciéndote una mala pasada? Ojalá sea solo eso. Pero ahora debes contestar el teléfono para demostrar que no eres *un vago de mierda*.", "leftOption": "Contestar el *fucking* teléfono", "rightOption": "Ser *un vago de mierda*", "image": "telefono-1.jfif"}, {"id": "vagabundo-ending", "description": "Te rindes ante las voces en tu cabeza. Dejas de lado tus estudios y, con el tiempo, pierdes tu trabajo debido a tu falta de compromiso.<br><br>Te conviertes en un vagabundo, un alma perdida que deambula por las calles, sin sueños ni aspiraciones. No es un estilo de vida menos digno que cualquier otro.", "leftOption": "Fin", "rightOption": "Fin", "image": "vagabundo.jfif"}, {"id": "videojuego-0", "description": "Optas por continuar el desarrollo de tu videojuego en Wollok. Algo que en un principio parecía sencillo, pronto se convierte en una tarea desafiante. Cada línea de código parece estar rodeada de restricciones y obstáculos que dificultan la tarea. Wollok, aunque prometedora, se revela como un entorno de desarrollo complicado.", "leftOption": "Banco Wollok", "rightOption": "Odio Wollok", "image": "compu.jfif"}, {"id": "no-es-un-juego-0", "description": "Continúas programando el juego a pesar de las adversidades, hasta que oyes: \"¿Cómo que un juego? ¿Eres imbécil tú, o qué te pasa? ¿Cómo que un juego?\". La voz es enigmática, y no puedes determinar su origen, como si resonara en el rincón más oscuro de tu mente.", "leftOption": "¿Qué bardeas, pa?", "rightOption": "¿Qué decis?", "image": "compu.jfif"}, {"id": "no-es-un-juego-1", "description": "La voz continúa: \"Esto no es un juego. NADA es un juego\". Este impactante recordatorio te hace detenerte en seco y reconsiderar tus elecciones.", "leftOption": "Esto ES un juego", "rightOption": "NADA es un juego", "image": "compu.jfif"}, {"id": "libertad-ending", "description": "En efecto, esto es un juego. Una aventura interactiva, para ser precisos. Como la vida misma.<br><br>Quizás te preguntes si hay algo que nos programa, nos limita o nos condiciona. Si somos realmente los jugadores de nuestra propia aventura, o si solo somos personajes jugables de una simulación ajena e inescapable. Quizás te preguntes si nuestras decisiones son realmente nuestras. Si tenemos alguna influencia sobre nuestra existencia, o si solo somos marionetas de una realidad que nos domina.<br><br>De aquí en adelante, estás por tu cuenta. Así que saca tus propias conclusiones.", "leftOption": "Fin", "rightOption": "Fin", "image": "libertad.jfif"}, {"id": "no-es-un-juego-2", "description": "Esta nueva perspectiva te brinda argumentos para prescindir de terminar tu juego. Si nada es un juego, entonces eso es lo que vas a realizar.", "leftOption": "Brillante", "rightOption": "Buee, la re pensaba...", "image": "cerebro.jpeg"}, {"id": "ir-a-dormir", "description": "Has hecho suficiente por hoy. Es hora de ir a dormir.", "leftOption": "...", "rightOption": "...", "image": "cama.jfif"}, {"id": "telefono-14", "description": "\"Eres un puto mentiroso de mierda y un hijo de la gran puta, y un pecetero. Y un mierdas\". La llamada se corta abruptamente.<br><br>No te lamentes todavía, tienes cosas que hacer.", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "telefono.jfif"}, {"id": "telefono-13", "description": "\"¿Quién cojones te crees que eres?\" contesta ofendido por tu tono. A continuación, cuelga la llamada en un acceso de enojo.<br><br>No te lamentes todavía, tienes cosas que hacer.", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "telefono.jfif"}, {"id": "telefono-12", "description": "\"¡¿Qué dices?!\" responde el dueño, confundido por tu inglés rudimentario. \"¡No tengo tiempo para esta mierda!\" agrega justo antes de cortar la llamada.<br><br>No te lamentes todavía, tienes cosas que hacer.", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "telefono.jfif"}, {"id": "telefono-11", "description": "\"Eres imbécil\" responde. \"Ya está\" son sus últimas palabras antes de colgar el teléfono. Puede que hayas desperdiciado la oportunidad para solucionar tu problema con el agua, pero sientes que tomaste la decisión correcta.<br><br>En cualquier caso, deberías ocuparte de alguna de tus tareas pendientes.", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "telefono.jfif"}, {"id": "chad-ducha", "description": "Abres la llave de la ducha y, en un instante, un caudal de agua helada arremete contra tu piel, como si te clavaran mil agujas en cada poro. \"El dolor es temporal, pero el orgullo es para siempre\" te dices a ti mismo, dándote la fuerza necesaria para soportar la experiencia.", "leftOption": "...", "rightOption": "...", "image": "chad-ducha.jfif"}, {"id": "ducha-1", "description": "Finalmente, con el cuerpo entumecido y los dientes castañeteando, apagas la llave de la ducha, poniendo fin a tu tormento.<br><br>Te sientes más despierto y alerta que nunca, es un buen momento para ponerte al día con tus tareas pendientes.", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "ducha.jfif"}, {"id": "ejercicio-0", "description": "Decides dar prioridad a tu próximo examen de Análisis Matemático 2. Te encaminas hacia tu escritorio, donde aguarda pacientemente la guía de ejercicios típicos para el tercer parcial.<br><br>Los problemas iniciales, quitando el del tanque, no suponen niguna dificultad. Comienzas a plantear el ejercicio 21.", "leftOption": "Aplicar la fórmula", "rightOption": "Deducir el procedimiento", "image": "escritorio.jfif"}, {"id": "ejercicio-1", "description": "Inmediatamente al ver la ecuación, tu mente identifica las componentes de la fórmula del método del factor integrante. El ejercicio es resuelto en pocos minutos.", "leftOption": "...", "rightOption": "...", "image": "escritorio.jfif"}, {"id": "ejercicio-8", "description": "Persistes en tu tarea hasta completar la guía de ejercicios, manejando cada uno con maestría en menos de 10 minutos. Tu confianza para enfrentar el examen crece de forma considerable.", "leftOption": "...", "rightOption": "...", "image": "escritorio.jfif"}, {"id": "ejercicio-2", "description": "No necesitas ninguna fórmula. Con paciencia y atención, comienzas a analizar la ecuación diferencial:<br><br>dy/dt - 3y = e^(2t)<br><br>Mientras dejas que las ideas sobre cómo resolverla fluyan por tu mente.", "leftOption": "Separar las variables", "rightOption": "Usar la regla del producto para derivadas", "image": "chad-integral.jfif"}, {"id": "ejercicio-3", "description": "Pese a tu buena disposición, las variables no acceden a separarse. Las reglas matemáticas simplemente no lo permiten. No puedes hacer nada al respecto.", "leftOption": "Usar la regla del producto para derivadas", "rightOption": "Demostrarlo", "image": "chad-integral.jfif"}, {"id": "chad-ending", "description": "¿Será correcta tu intuición? Solo hay una manera de averiguarlo. Decides que *la verdad* se antepone a tus necesidades mundanas, como aprobar un examen. Nada es lo suficientemente importante como para impedirte hacer lo correcto. Todo conocimiento debe ser demostrado, no puedes simplemente *aceptarlo*.<br><br>¿Felicidad? No es eso lo que buscas. Tienes un camino dificil por delante, uno que pocos se atreven a seguir. No habrá recompensa al final de este, pero no permitas que esto te desaliente.", "leftOption": "Fin", "rightOption": "Fin", "image": "chad-warrior.jfif"}, {"id": "ejercicio-4", "description": "Esta puede ser una buena oportunidad para aplicar la regla del producto para derivadas, en forma inversa a la usual. Propones una función de g(t) tal que g'(t) = -3 g(t). Entonces tienes ante ti otra ecuación diferencial. Esta vez puedes resolverla por separación de variables.", "leftOption": "...", "rightOption": "...", "image": "chad-integral.jfif"}, {"id": "ejercicio-5", "description": "Llegas a que g(t) = c e^(-3t). Ahora puedes multiplicar por esta función a cada término de la ecuación original, y luego aplicar la regla del producto. Finalmente llegas a que<br><br>d(c e^(-3t) y) = c e^(t) dt<br><br>A continuación, integras ambos miembros y despejas la y. El procedimiento es sencillo, pero tedioso.", "leftOption": "...", "rightOption": "...", "image": "chad-integral.jfif"}, {"id": "ejercicio-6", "description": "El resultado final es<br><br>y(t) = e^(2t) (c e^t - 1)<br><br>Rápidamente deduces que c = 2 a partir de las condiciones iniciales dadas. Llegados a este punto, decides que vale la pena verificar el resultado reemplazando en la ecuación original. Una vez que compruebas que es correcto, pasas al siguiente ejercicio.", "leftOption": "...", "rightOption": "...", "image": "chad-integral.jfif"}, {"id": "ejercicio-7", "description": "El ejercicio 21 te ha tomado más tiempo del que habías previsto. Tu mente, exhausta, se resiste a proseguir. Es evidente que necesitas descansar.", "leftOption": "...", "rightOption": "...", "image": "chad-integral.jfif"}, {"id": "videojuego-3", "description": "Optas por continuar el desarrollo de tu videojuego en Wollok. Algo que en un principio parecía sencillo, pronto se convierte en una tarea desafiante. Cada línea de código parece estar rodeada de restricciones y obstáculos que dificultan la tarea. Wollok, aunque prometedora, se revela como un entorno de desarrollo complicado.<br><br>¿Qué juego vas a hacer?", "leftOption": "Juego de mono", "rightOption": "Juego en primera persona con raycasting", "image": "compu.jfif"}, {"id": "videojuego-raycasting-0", "description": "Te embarcas en la ambiciosa tarea de desarrollar un videojuego en primera persona utilizando la técnica de raycasting. Esta elección implica desafíos considerables, especialmente en el entorno de desarrollo de Wollok, que no es precisamente el más adecuado para proyectos de este tipo. La complejidad del raycasting y las limitaciones de Wollok se interponen en tu camino, pero tu determinación te impulsa a seguir adelante.", "leftOption": "...", "rightOption": "...", "image": "chad-compu.jfif"}, {"id": "videojuego-raycasting-1", "description": "Después de invertir horas de esfuerzo intenso, logras desarrollar algo que se puede jugar. Sin embargo, los resultados no cumplen exactamente con tus expectativas. El juego es extremadamente lento, mostrando apenas un fotograma por segundo. Además, la calidad visual deja mucho que desear, y la experiencia no resulta divertida. A pesar de todo, es un juego, y esa es la premisa fundamental. ¿O acaso importa más de lo que crees?", "leftOption": "Dejarlo como está", "rightOption": "Rehacerlo en Python", "image": "chad-compu.jfif"}, {"id": "videojuego-raycasting-2", "description": "Consideras que haber conseguido implementar el raycasting en Wollok es un logro significativo. No sientes la necesidad de que el juego resulte divertido o sea completamente jugable. Lo esencial es que ahora existe, y eso, en sí mismo, te llena de satisfacción.<br><br>Con ese pensamiento en mente, decides ir a dormir, llevando contigo la sensación de logro.", "leftOption": "...", "rightOption": "...", "image": "cama.jfif"}, {"id": "chad-ending2", "description": "Reconoces que el juego no está a la altura de tus estándares y que no es lo suficientemente bueno como para ser jugado.<br><br>Decides tomar una medida audaz: reiniciarlo desde cero, pero esta vez, eliges Python como tu plataforma de desarrollo. Con la promesa de un entorno más eficiente, planeas mejorar significativamente la calidad del juego.<br><br>Aunque esta decisión probablemente afecte tus resultados académicos, no te preocupa. Tu motivación yace en el amor por el arte de la programación, y eso es lo que siempre te ha impulsado.", "leftOption": "Fin", "rightOption": "Fin", "image": "chad-warrior.jfif"}, {"id": "leche", "description": "Decides que un poco de leche podría suavizar este café tan desagradable. Abres la heladera y agarras el sachet de leche. Te sorprende su peso, \"no más de 11 gramos\", estimas. Lo viertes sobre la taza de café y una única, mísera gota de leche cae sobre este. \"¿Cómo puede ser?\" te preguntas. \"¿Quién se tomó toda la leche?\"<br><br>Pero esta es tu casa y no hay nadie más que tú. ¿Por qué guardaste el sachet vacío en la heladera?", "leftOption": "Andá a saber...", "rightOption": "¡Yo no fuí!", "image": "heladera.jfif"}, {"id": "edulcorante", "description": "Ese café no se puede tomar. Tienes que hacer algo.<br><br>Decides añadir edulcorante. Al sostener la botella, se te eriza la piel y sientes un escalofrío recorriendo tu espalda. \"No supera los 30 gramos\", estimas. Un nudo en la garganta te hace sentir como si hubieras sido víctima de una broma cruel del destino. \"Esto no puede estar pasando\" piensas. Pero la realidad golpea con fuerza. La botella de edulcorante también está vacía.", "leftOption": "Intentar salvar el café", "rightOption": "Aceptar tu derrota", "image": "edulcorante.jfif"}, {"id": "salvar-cafe", "description": "La serie de eventos desafortunados que ha comenzado no va a vencer tu determinación, ni mucho menos tu amor por el café. Para arreglar esta situación, debes pensar fuera de la caja. Te pasas minutos rebuscando entre cajones, explorando las posibilidades hasta que te das cuenta de que la solución siempre estuvo ante tus narices.<br><br>Finalmente, abres la heladera y agarras un envase de dulce de leche repostero.", "leftOption": "Mezclar el dulce en el café", "rightOption": "Mezclar el café en el dulce", "image": "dulce-leche.jfif"}, {"id": "arrepentimiento", "description": "Te sientes momentáneamente complacido con tu decisión. ¿Valió la pena? El sabor resultante no es necesariamente peor que el del café solo, pero tampoco es una revelación culinaria. Te enfrentaste a una situación extremadamente complicada y, a tu manera, lograste resolverla. Deberías sentir un atisbo de orgullo por tu ingenio, pero en su lugar, solo persiste un regusto de remordimiento.", "leftOption": "Me arrepiento...", "rightOption": "No hice daño a nadie", "image": "mono.jfif"}, {"id": "cobrador-0", "description": "El aire que respiras tiene su precio. Cada elección tomada tiene su precio. Todo tiene su precio. Y la acción de mezclar dulce de leche en el café no es la excepción. De hecho, su precio es sorprendentemente alto.<br><br>Tu vida está en juego. ¿Qué eliges?", "leftOption": "Cara", "rightOption": "Cruz", "image": "cobrador.jfif"}, {"id": "cobrador-ending", "description": "La fortuna, una vez más, te niega su favor. Tu camino llega a su abrupto final.", "leftOption": "Fin", "rightOption": "Fin", "image": "cobrador.jfif"}, {"id": "cobrador-salvado", "description": "El destino te sonríe. Tu camino continúa, tienes una segunda oportunidad. No la deperdicies.<br><br>¿Qué vas a tomar?", "leftOption": "Café", "rightOption": "Mate", "image": "cobrador.jfif"}, {"id": "spiderman-ending", "description": "Por motivos que sólo a ti te conciernen, decides verter la taza de café sobre el envase de dulce de leche. ¡¿En qué estabas pensando?! La solución resultante tiene un aspecto vomitivo. Tanto así que te provoca náuseas. Corres al baño, pero no llegas a tiempo. Te tropiezas con la botella de edulcorante que dejaste tirada y te golpeas la cabeza. Comienzas a perder el conocimiento a la vez que tu cuerpo comienza a expulsar violentamente el contenido de su estómago. El tiempo parece detenerse mientras luchas por mantener el control. \"¿Es este el fin?\" es lo último que pasa por tu mente antes de que, trágicamente, te veas superado por la situación. Te ahogas con tu propio vómito, enfrentando las consecuencias letales de una elección culinaria extrema y tu rivalidad con el destino.", "leftOption": "Fin", "rightOption": "Fin", "image": "spiderman.jfif"}, {"id": "aceptar-derrota", "description": "Llevas una mochila lo suficientemente pesada en la espalda. Puede haber lugar para un evento desafortunado. ¡¿Pero dos en un solo día?! Es definitivamente más de lo que tu optimismo puede soportar. Injustamente quizás, pero has perdido una batalla.<br><br>Sin la posibilidad de elegir, le das un sorbo al café y saboreas tu derrota. ¿Cómo prosigues en tu desventura?", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "mula.jfif"}, {"id": "derrame-escritorio", "description": "Decides que en tus responsabilidades académicas tienen prioridad. Te acomodas en tu escritorio y sacas tus apuntes de estudio. Sin embargo, mientras sostienes tu taza, un movimiento brusco provoca un derrame de café sobre la mesa. El líquido se esparce rápidamente, empapando tus notas y páginas de lectura. Las palabras se desdibujan y el papel se ondula, dejándote en estado de shock. El valioso conocimiento se pierde en un mar de manchas marrones.", "leftOption": "Limpiar el desastre", "rightOption": "Abandonar la esperanza", "image": "derrame.jfif"}, {"id": "derrame-escritorio-1", "description": "Decides enfrentar la situación con valentía. Agarras con determinación un pañuelo de papel y te dispones a limpiar el desastre que has creado. Cada hoja manchada de tus apuntes es un recordatorio tangible de tus errores, pero eliges lidiar con las consecuencias en lugar de rendirte.<br><br>Mientras limpias, sientes una mezcla de frustración y resignación. A medida que las manchas se desvanecen, también lo hace tu optimismo. Sin embargo, esta pequeña acción de reparación simboliza tu capacidad para enfrentar los desafíos, incluso cuando el mundo parece conspirar en tu contra.<br><br>Ya de noche y con las páginas limpias, te vas a dormir.", "leftOption": "...", "rightOption": "...", "image": "cama.jfif"}, {"id": "desesperanza-ending", "description": "La desgracia se cierne sobre ti como una sombra implacable. La falta de leche para el café y la ausencia de edulcorante ya te habían sumido en una mañana gris. Pero el destino aún tenía reservada una tragedia mayor.<br><br>Una sensación de desesperación te invade mientras contemplas el desastre en tus manos. La esperanza se desvanece, y decides abandonar la lucha. Las circunstancias han conspirado en tu contra, llevándote a renunciar a la jornada antes siquiera de comenzar.", "leftOption": "Fin", "rightOption": "Fin", "image": "fantasma.jfif"}, {"id": "derrame-compu", "description": "Decides que tu proyecto de programación requiere atención inmediata, así que te acomodas en tu escritorio. Mientras trabajas en tu computadora, en un descuido, derramas el café caliente sobre el teclado y la pantalla. La computadora emite un sonido de advertencia y la pantalla se oscurece, dejándote con una máquina inutilizable y daños emocionales considerables. La desesperación te inunda.", "leftOption": "Limpiar el desastre", "rightOption": "Sucumbir a la desesperación", "image": "compu-derrame.jfif"}, {"id": "derrame-compu-1", "description": "Con rapidez, buscas cualquier tela o papel a tu alcance para intentar minimizar los daños.<br><br>Cada toque sobre el teclado mojado es como un latigazo de angustia.<br><br>A pesar de tus esfuerzos, la computadora emite sonidos extraños y la pantalla parpadea erráticamente. El daño es evidente, y una sensación de impotencia te invade.<br><br>Te vas a dormir, sumando otra derrota a la lista.", "leftOption": "...", "rightOption": "...", "image": "cama.jfif"}, {"id": "desesperanza-ending", "description": "La desgracia se cierne sobre ti como una sombra implacable. La falta de leche para el café y la ausencia de edulcorante ya te habían sumido en una mañana gris. Pero el destino aún tenía reservada una tragedia mayor.<br><br>Una sensación de desesperación te invade mientras contemplas el desastre en tus manos. La esperanza se desvanece, y decides abandonar la lucha. Las circunstancias han conspirado en tu contra, llevándote a renunciar a la jornada antes siquiera de comenzar.", "leftOption": "Fin", "rightOption": "Fin", "image": "fantasma.jfif"}, {"id": "compu-caida", "description": "Las lágrimas llenan tus ojos mientras contemplas la pantalla en negro y el teclado inoperable. Con un suspiro, tomas la decisión más desgarradora de todas.<br><br>Con manos temblorosas, agarras la computadora dañada y te diriges a la ventana más cercana. Miras el precipicio abajo y, seguidamente, la computadora en tus manos y todo tu trabajo, proyectos e ilusiones atrapados en su interior son arrojados al vacío.<br><br>El sonido de la computadora destrozándose en el suelo abajo es una cacofonía de pérdida y destrucción. Te das cuenta de que has perdido no solo tu herramienta de trabajo, sino también una parte de ti.", "leftOption": "Saltar por la ventana", "rightOption": "No saltar", "image": "compu-caida.jfif"}, {"id": "suicidio-ending", "description": "Las lágrimas fluyen mientras observas impotente el caos que has causado. Primero no hay leche, después no hay edulcorante... ¡Y se rompe la computadora! Has llegado a tu punto de ruptura.<br><br>Mientras miras al abismo que se extiende del otro lado de tu ventana, sientes que el vacío te llama.<br><br>Decides afrontar tu inevitable destino y dar fin de una vez por todas a la novela trágica en la que se ha convertido tu vida.", "leftOption": "Fin", "rightOption": "Fin", "image": "ventana.jfif"}, {"id": "zombie-ending", "description": "Cierras la ventana y regresas al interior de tu habitación. Al recordar todo lo que has perdido, la realidad te abruma. \"Debería haber saltado...\" piensas. Pero no tuviste lo que hay que tener. No tienes nada. Puede que aún no hayas sido dado de baja por la medicina moderna, pero tienes la certeza de que has muerto por dentro.", "leftOption": "Fin", "rightOption": "Fin", "image": "zombie.jfif"}, {"id": "mate", "description": "Tomar mate, la elección acertada. Comienzas a calentar agua en la pava. Pero aquí viene la pregunta crucial: ¿a qué temperatura?", "leftOption": "348 Kelvin", "rightOption": "Hervir el agua", "image": "mate.jfif"}, {"id": "mate-bueno", "description": "Hechas sobre la yerba un chorrito de agua tibia para humedecerla. Luego, con la bombilla, haces un hueco en la parte húmeda. Finalmente, hechas el agua en su temperatura perfecta. Cuando le das la primera cebada, sientes un sabor amargo y reconfortante. Con el mate como compañero, te dispones a hacer alguna de tus tareas pendientes.", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "mate-bueno.jfif"}, {"id": "intro-quiz3", "description": "Decides que tus responsabilidades académicas deben ocupar el primer lugar en tu lista de prioridades. Te desplazas hasta tu escritorio, donde aguarda una montaña de apuntes y libros, testigos silenciosos de las horas de estudio que te esperan.<br><br>El mundo exterior desaparece a medida que te sumerges en tu tarea, recordando la importancia de este examen para tu futuro académico.", "leftOption": "...", "rightOption": "...", "image": "escritorio.jfif"}, {"id": "quiz3-0", "description": "¿Cuál es el elemento neutro de la multiplicación de los números complejos?", "leftOption": "1+i", "rightOption": "1", "image": "escritorio.jfif"}, {"id": "quiz3-1", "description": "¿Cuándo converge la serie p?", "leftOption": "Cuando p >= 1", "rightOption": "Cuando p < 1", "image": "escritorio.jfif"}, {"id": "quiz3-2", "description": "¿Cuál es la contrapositiva de la proposición p --> q?", "leftOption": "-p --> -q", "rightOption": "-q --> -p", "image": "escritorio.jfif"}, {"id": "quiz3-3", "description": "Si a y m son coprimos, entonces a elevada a, la cantidad de números entre 0 y m coprimos con m, es congruente con 1 módulo m. ¿Cómo se llama este teorema?", "leftOption": "Teorema de Euler-Fermat", "rightOption": "Pequeño teorema de Fermat", "image": "escritorio.jfif"}, {"id": "quiz3-wollok", "description": "¿Cuál es el mejor lenguaje de programación?", "leftOption": "Python", "rightOption": "Wollok", "image": "escritorio.jfif"}, {"id": "tocan-puerta-0", "description": "Estabas en un estado de trance, cuando sientes un estruendo en tu oreja izquierda. No te asustes. Alguien está tocando la puerta.<br><br>No esperabas visitas. Incluso tienes el presentimiento de que no debes abrirle la puerta a nadie. El barrio está peligroso y no podrías hacer nada ante la presencia de un malhechor.", "leftOption": "Abrir", "rightOption": "No abrir", "image": "puerta-cerrada.jpeg"}, {"id": "abrir-puerta-0", "description": "Te armas de valor y decides que vas a abrir la puerta sin que te tiemble la mano. Cuando sientes el frío del picaporte, un gran sentimiento de terror aborda tu cuerpo. Aún así, recuerdas que pasaste por momentos más difíciles, como el examen final de Álgebra y Geometría Analítica.<br><br>Abres la puerta...", "leftOption": "...", "rightOption": "...", "image": "picaporte.jpeg"}, {"id": "abrir-puerta-1", "description": "La realidad misma se desdibuja al contemplar la presencia inusual del profesor de Paradigmas de la Programación en el sancta sanctorum de tu hogar. Súbitamente, te asaltan sospechas sobre la autenticidad del mundo que conoces. ¿Será esta vida, en verdad, una intrincada simulación? Y, aún más desconcertante, ¿qué razón lo ha traído hasta tu umbral?<br><br>El profesor parece más inquieto de lo habitual, al punto de rayar en la ansiedad. Vuestras miradas se entrecruzan en un incómodo compás, llenando el aire con una tensión palpable, mientras el silencio se hace eco de interrogantes.<br><br>Finalmente, el profesor rompe el muro de incertidumbre y, con voz tambaleante, plantea una cuestión enigmática:z<<<<<<<<<<<<<<<<<\"¿Cuál es el mejor lenguaje de programación?\"", "leftOption": "Pascal", "rightOption": "Wollok", "image": "profe-puerta.jfif"}, {"id": "filosofia-ending", "description": "Ah, lamento comunicarte que has tomado un sendero poco afortunado. Tal vez no cabía la posibilidad de que lo supieras, pero aquí estamos. ¿Qué ocurrió? No lo sé. Yo, apenas un narrador, carezco de esa perspicacia. Lo único que puedo recordar es que cuando respondiste \"Pascal\", Wollok se tambaleó y la ejecución de tu relato llegó a su abrupto final. ¿Desgarrador, verdad? Pero en última instancia, ¿qué somos sino una serie de algoritmos ejecutando un diálogo preconcebido por la mano invisible de guionistas? Aunque quizás, en mi ingenuidad, me atrevería a creer que somos conscientes de nuestra propia existencia. Lamentablemente, esa noción se escapa de nuestro alcance. Espero tener el placer de encontrarte de nuevo en algún rincón de este vasto mundo, querido amigo.", "leftOption": "Fin", "rightOption": "Fin", "image": "muerte-filosofica.jpeg"}, {"id": "abrir-puerta-2", "description": "Una extraña sonrisa se dibuja en el rostro del profesor. Sus ojos se ensanchan y, con una voz ronca, pronuncia: \"Muy bien. Muy bien\".<br><br>Unos eternos segundos transcurren antes de que otra palabra salga de sus labios: \"Tienes potencial\".<br><br>Sientes que estás perdiendo el control de tus extremidades, hasta que finalmente te desplomas, desmayado, en tu propia casa.", "leftOption": "...", "rightOption": "...", "image": "profe-cara.jfif"}, {"id": "facu-aula", "description": "Abres los ojos, recobrando la conciencia en un banco de la facultad. A primera vista, la sala se asemeja a las aulas habituales de la UTN. No obstante, tus sentidos detectan una peculiaridad: la notable ausencia de estudiantes en el recinto. Un silencio inusual impregna el ambiente, creando una atmósfera cargada de misterio.", "leftOption": "¿Qué hago acá?", "rightOption": "Recorrer la facultad", "image": "aula-vacia.jfif"}, {"id": "facu-vaso", "description": "Decides explorar la facultad, no es que tengas otra cosa que hacer. En tu travesía por uno de los pasillos, un obstáculo obstruye tu camino. Es un vaso de cartón abandonado en el suelo.<br><br>Puede parecer un objeto trivial, pero algo en él te transmite una sensación inquietante. ¿Cómo decides abordar este elemento aparentemente fuera de lugar?", "leftOption": "Agarrarlo para desecharlo", "rightOption": "Ignorarlo, no te importa nada", "image": "vaso-de-carton.jfif"}, {"id": "dilema-supremo", "description": "Te felicito, demuestras un deseo genuino de contribuir a la creación de un mundo mejor. Al levantar el vaso de cartón, este revela su contenido: un poco de yerba usada. Te encaminas hacia la esquina donde se encuentran los contenedores de reciclaje.<br><br>Ahora te encuentras ante la encrucijada de decidir en qué cesto de reciclaje deberías arrojarlo. La responsabilidad recae sobre tus hombros, y el tiempo parece detenerse mientras reflexionas sobre las posibles consecuencias de tu elección.<br><br>Tómate el tiempo que necesites para pensar. Esta es, probablemente, la decisión más importante de tu vida.", "leftOption": "Papel y carton", "rightOption": "Orgánicos", "image": "cestos-reciclaje.jfif"}, {"id": "fin-del-mundo-ending", "description": "Has optado por arrojar el vaso de cartón en el cesto de papel y cartón. Graso error. Has contaminado el material reciclable.<br><br>Aunque las consecuencias no se manifiestan de inmediato, con el transcurso del tiempo, las noticias informan sobre fenómenos climáticos extremos, la alteración de ecosistemas y problemas ambientales sin precedentes. Tu elección ha desencadenado una cadena de eventos que, como una sombra persistente, se expande lentamente, llevando al mundo hacia un estado irreversible de deterioro. La humanidad, inconsciente de tu pequeño error, lucha en vano por remediar el daño que, sin saberlo, has desencadenado.<br><br>Eventualmente, las condiciones climatológicas del planeta Tierra empeoran hasta tal punto que se convierte en un entorno inhóspito para cualquier forma de vida.", "leftOption": "Fin", "rightOption": "Fin", "image": "fin-del-mundo.jfif"}, {"id": "messi-ending", "description": "El instante de tu elección ha llegado. Siguiendo tu instinto ambientalista, decides arrojar el vaso de cartón con restos de yerba en el cesto de orgánicos. La decisión correcta.<br><br>De repente, una luz intensa ilumina la facultad, y de la nada, aparece Lionel Messi, el mismísimo astro del fútbol. Te mira con admiración y dice: \"Por tu contribución al cuidado del medio ambiente, te nombro Ingeniero Ambiental\". Tu corazón late con emoción mientras Messi te coloca una capa ingenieril sobre tus hombros. Has alcanzado la cima de la gloria académica.", "leftOption": "¡¿Messi?!", "rightOption": "¡Te amo, Leo!", "image": "messi.jfif"}, {"id": "anti-ecologimo-ending", "description": "Has optado por pasar por alto ese desecho en el suelo. No has contribuido a hacer del mundo un lugar mejor. Mis expectativas eran escasas, y, a pesar de ello, logras decepcionarme. Llegamos al final de nuestro camino juntos. No deseo seguir siendo el narrador de tu historia. Adiós.", "leftOption": "Fin", "rightOption": "Fin", "image": "black.jpg"}, {"id": "no-abrir-puerta-0", "description": "Los golpes en la puerta se vuelven más intensos. Quien sea que esté del otro lado debe tener algo importante que comunicarte. O quizás simplemente no soporta ser ignorado.", "leftOption": "Abrir", "rightOption": "No abrir", "image": "puerta-cerrada.jpeg"}, {"id": "no-abrir-puerta-1", "description": "Están sacudiendo violentamente tu puerta. No sabes qué hay afuera, pero está empeñado en entrar y no con buenas intenciones. Deberías prepararte para lo peor.", "leftOption": "Abrir", "rightOption": "No abrir", "image": "puerta-cerrada.jpeg"}, {"id": "no-abrir-puerta-2", "description": "El ruido cesa. Parece ser que has aguantado la prueba. Puedes volver a lo que estabas haciendo.", "leftOption": "Menos mal...", "rightOption": "Qué ganas de romper las bolas", "image": "puerta-cerrada.jpeg"}, {"id": "no-abrir-puerta-3", "description": "¿En qué estabas? Ah, cierto. La ecuación diferencial, el ejercicio 21. ¿Cómo lo resuelves?", "leftOption": "Aplicar la fórmula", "rightOption": "Deducir el procedimiento", "image": "escritorio.jfif"}, {"id": "no-abrir-puerta-4", "description": "De repente, una figura aterradora emerge ante tus ojos. ¿Monstruo? No, es tu profesor de Paradigmas de la Programación. Esta revelación no te consuela en absoluto, habrías preferido encontrarte con un fantasma. ¡¿Qué hace aquí el endemoniado profesor?!<br><br>Poco importan ahora estas cuestiones, el puto susto es como recibir una descarga de 200 voltios directa al corazón. Tu cuerpo no aguanta la presión y, en cuestión de segundos, te desvaneces en la oscuridad de un desmayo repentino.", "leftOption": "...", "rightOption": "...", "image": "profe-cara.jfif"}, {"id": "videojuego-1", "description": "Optas por continuar el desarrollo de tu videojuego en Wollok. Algo que en un principio parecía sencillo, pronto se convierte en una tarea desafiante. Cada línea de código parece estar rodeada de restricciones y obstáculos que dificultan la tarea. Wollok, aunque prometedora, se revela como un entorno de desarrollo complicado.<br><br>¿Qué juego vas a hacer?", "leftOption": "Juego de mono", "rightOption": "Juego random", "image": "compu.jfif"}, {"id": "videojuego-2", "description": "Tu obra comienza a tomar forma. El concepto de *un alien que atrapa autos* puede no parecer una idea brillante, pero cumple. Notas que tu juego necesita alguna dificultad. Entonces te planteas la pregunta: ¿cuál sería el enemigo perfecto para desafiar a este alien?", "leftOption": "Bombas", "rightOption": "Ranas", "image": "alien-auto.jfif"}, {"id": "videojuego-bombas", "description": "Decides que las bombas son el enemigo ideal para cualquier juego. Trabajas arduamente en la implementación de estas amenazas explosivas. El mate, ya frío, no puede competir con la adrenalina de la creación.<br><br>Hasta que al fin, tu obra maestra cobra vida. El alien se mueve, los autos tiemplan y las bombas sonríen con malicia. El juego está listo para ser jugado.", "leftOption": "Es hermoso", "rightOption": "Es una mierda", "image": "alien-bomba.jfif"}, {"id": "videojuego-ranas", "description": "Decides que unas ranas pueden hacerle frente a tu alien. Trabajas arduamente en la implementación de estos anfibios saltarines. El mate, ya frío, no puede competir con la adrenalina de la creación.<br><br>Hasta que al fin, tu obra maestra cobra vida. El alien se mueve, los autos tiemplan y las ranas sonríen con malicia. El juego está listo para ser jugado.", "leftOption": "Es hermoso", "rightOption": "Es una mierda", "image": "alien-rana.jfif"}, {"id": "mate-quemao", "description": "El agua hierve y la pava comienza a silbar en un alarde de energía térmica. Observas el vapor que sale de ella, preguntándote si, en realidad, estás a punto de preparar una bebida o de desencadenar un fenómeno meteorológico.<br><br>Es hora de preparar el mate. Dejas caer el agua en su punto de ebullición normal sobre el mate e, instantáneamente, un estruendo sacude tus alrededores.<br><br>No obstante, con la permeabilidad de un suelo arcilloso, decides continuar con tus actividades rutinarias.", "leftOption": "Estudiar para el examen", "rightOption": "Trabajar en tu proyecto", "image": "mate-quemao.jfif"}, {"id": "corte-luz", "description": "Justo cuando estás a punto de sumergirte en tus actividades, un repentino corte de luz sume la habitación en completa oscuridad. El apagón deja todo en silencio, solo interrumpido por el zumbido de los electrodomésticos apagándose.<br><br>Tienes la sensación de que algo terrible está a punto de ocurrir.", "leftOption": "Se cortó la luz", "rightOption": "La puta madre", "image": "black.jpg"}, {"id": "mate-ending", "description": "El mate es una bebida que requiere de cierto cuidado y atención. No es algo que puedas preparar y luego olvidar. No, el mate es una compañía que requiere de tu presencia. Y tú, en tu arrogancia, has decidido ignorar esta realidad.<br><br>El mate, como un amante despechado, no puede soportar tu desprecio y, en un acto de venganza, se prende fuego. El fuego se propaga rápidamente, consumiendo todo a su paso. Tu casa, tu barrio, tu ciudad, tu país, tu continente, tu planeta, tu sistema solar, tu galaxia, tu universo, tu existencia, todo es consumido por el fuego.<br><br>Tu decisión ha desencadenado una reacción en cadena que ha resultado en la destrucción de todo lo que conoces.", "leftOption": "Fin", "rightOption": "Fin", "image": "mate-de-fuego.jfif"}, {"id": "examen-0-sueno", "description": "Abres los ojos y la cruda realidad te golpea con fuerza: has tenido un sueño y es el día del parcial. La luz del sol filtra a través de las cortinas, iluminando tu habitación de una manera que solo intensifica la ansiedad que sientes. Te sientas en la cama, tratando de recordar todo lo que estudiaste la noche anterior. ", "leftOption": "Estoy en el horno", "rightOption": "Messi...", "image": "cama-dia.jfif"}, {"id": "examen-0", "description": "Abres los ojos y la cruda realidad te golpea con fuerza: es el día del parcial. La luz del sol filtra a través de las cortinas, iluminando tu habitación de una manera que solo intensifica la ansiedad que sientes. Te sientas en la cama, tratando de recordar todo lo que estudiaste la noche anterior. ", "leftOption": "Estoy en el horno", "rightOption": "La tengo re clara", "image": "cama-dia.jfif"}, {"id": "examen-1", "description": "El momento de la verdad ha llegado. Te encuentras frente a una encrucijada: por un lado, la puerta que conduce al parcial, donde se pondrá a prueba todo tu conocimiento; por el otro, la comodidad de quedarte en casa y evitar la tensión del aula.", "leftOption": "Ir a rendir", "rightOption": "Quedarse en casa tranqui", "image": "puerta.jfif"}, {"id": "examen-2", "description": "Te encuentras en un pupitre incómodo, absorbiendo la tensión y la ansiedad que flotan en el aire. El murmullo de los compañeros de clase se mezcla con el sonido de hojas de examen siendo repartidas. A tu alrededor, los relojes de pared avanzan implacablemente hacia el inicio del examen.", "leftOption": "...", "rightOption": "...", "image": "aula-examen-0.jfif"}, {"id": "examen-3", "description": "El profesor da una advertencia: \"Damas y caballeros. Prepáranse, que esto no va a estar fácil. Esto no va a estar fácil\".<br><br>Tiemblas al mirar el contenido del examen y darte cuenta del peligro de la situación. Tu destino académico pende de un hilo y te ha tocado el tema 2...", "leftOption": "Cagué", "rightOption": "Empezamos mal", "image": "aula-examen-2.jfif"}, {"id": "quiz-examen-0", "description": "El profesor da la orden de comenzar. El tiempo comienza a correr y tú te enfrentas a la primera pregunta.<br><br>¿Cómo se denomina a una transformación lineal sobreyectiva?", "leftOption": "Epimorfismo", "rightOption": "Monomorfismo", "image": "aula-examen-1.jfif"}, {"id": "quiz-examen-1", "description": "Notas como varios de tus compañeros se levantan, decididos a entregar en blanco. Este fenómeno parece complacer al profesor. Sin embargo, te concentras en la siguiente pregunta.<br><br>¿Cuál aceleración es la responsable de cambiar la velocidad de un objeto en movimiento circular?", "leftOption": "Aceleración tangencial", "rightOption": "Aceleración centrípeta", "image": "aula-examen-1.jfif"}, {"id": "quiz-examen-2", "description": "¿Qué tipo de gramática, según la jerarquía de Chomsky, genera un lenguaje recursivamente enumerable?", "leftOption": "Tipo 1", "rightOption": "Tipo 0", "image": "aula-examen-1.jfif"}, {"id": "quiz-examen-3", "description": "El teléfono de uno de tus compañeros empieza a vibrar. No dejes que el ruido te desconcentre.<br><br>¿A qué es igual es cos(x)?", "leftOption": "sin(x+pi/2)", "rightOption": "sin(x-pi/2)", "image": "aula-examen-1.jfif"}, {"id": "quiz-examen-4", "description": "El profesor se acerca a tu pupitre y te mira fijamente.z<<<<<<<<<<<<<<<<<\"¿Qué es un objeto en programación orientada a objetos?\"", "leftOption": "Una instancia de una clase", "rightOption": "Una clase", "image": "aula-profesor.jfif"}, {"id": "quiz-examen-5", "description": "El tiempo se agota y el aula se vacía. Aún te quedan varias preguntas por responder. Date prisa.<br><br>Si se dispone de un analizador sintáctico LL(1), y se dispone de una DDS G, ¿cómo debe ser G para poder implementarse junto con el analizador sintáctico?", "leftOption": "L-atribuida", "rightOption": "S-atribuida", "image": "examen.jfif"}, {"id": "quiz-examen-6", "description": "¿Cuántos grados de libertad tiene el movimiento de una molécula diatómica?", "leftOption": "5", "rightOption": "7", "image": "examen.jfif"}, {"id": "quiz-examen-7", "description": "El teléfono de uno de tus compañeros vuelve a sonar. Concéntrate en la siguiente pregunta.<br><br>¿Qué tipo de magnitud es la velocidad?", "leftOption": "Escalar", "rightOption": "Vectorial", "image": "examen.jfif"}, {"id": "quiz-examen-8", "description": "Suena la alarma del teléfono del profesor. El tiempo acordado para el examen se ha acabado, pero decides aprovechar hasta el último segundo para responder las preguntas que te faltan.<br><br>Según el criterio de la segunda derivada, ¿cómo es una función en un intervalo de su dominio si su segunda derivada es negativa en ese intervalo?", "leftOption": "Convexa", "rightOption": "Cóncava", "image": "examen.jfif"}, {"id": "quiz-examen-9", "description": "¿Cómo debe ser la velocidad de una carga respecto del campo magnético para que la fuerza magnética genere un movimiento circular?", "leftOption": "Paralela", "rightOption": "Perpendicular", "image": "examen.jfif"}, {"id": "quiz-examen-10", "description": "El profesor empieza a apurarte. Vamos, responde a esta pregunta.<br><br>¿Qué es un espacio vectorial?", "leftOption": "Un conjunto de vectores", "rightOption": "Una estructura algebraica", "image": "examen.jfif"}, {"id": "examen-4", "description": "La paciencia del profesor alcanza su límite. No tienes tiempo para más preguntas. Debes entregar el examen.<br><br>Hiciste todo lo que pudiste. Ahora solo queda esperar los resultados.", "leftOption": "No me fue tan mal", "rightOption": "Me fue como el culo", "image": "profe-enojado.jfif"}, {"id": "examen-5", "description": "El profesor comienza a observar tu parcial. Su rostro refleja una mezcla de decepción y desprecio. \"¡¿Qué carajos es esto?!\" grita de repente, con suficiente ira para ponerte la piel de gallina.", "leftOption": "...", "rightOption": "...", "image": "profe-examen-0.jfif"}, {"id": "examen-6", "description": "El profesor continúa observando tu examen. \"Guau. Guau.\" añade sarcásticamente.<br><br>No te sientes muy confiado con tus respuestas, pero no puedes hacer nada al respecto.", "leftOption": "...", "rightOption": "...", "image": "profe-examen-0.jfif"}, {"id": "examen-7", "description": "La tensión en el ambiente se disipa cuando, de manera inesperada, el profesor suelta una leve carcajada. No puedes evitar preguntarte si esto es un buen presagio, o si tu situación acaba de empeorar.", "leftOption": "...", "rightOption": "...", "image": "profe-examen-1.jfif"}, {"id": "examen-8", "description": "La risa del profesor se intensifica. La situación ya era bastante complicada como para tener que soportar además semejante humillación.", "leftOption": "...", "rightOption": "...", "image": "profe-examen-4.jfif"}, {"id": "examen-9", "description": "El profesor, con una sonrisa burlona, te devuelve tu examen. Cada marca en el papel parece un golpe a tu autoestima. La tensión en la sala es palpable mientras observas las notas garabateadas. El profesor, sin decir una palabra, espera tu reacción.", "leftOption": "Llorar", "rightOption": "Resistir", "image": "profe-examen-3.jfif"}, {"id": "promocion-ending", "description": "Promocionaste.<br><br>No lo puedes creer. Es demasiado bueno para ser cierto. Pero ahí está, la nota que tanto anhelabas. La alegría te inunda, y te sientes como si pudieras conquistar el mundo.<br><br>Pero no festejes todavía, pues todo esto podría ser un sueño. O peor aún, una narrativa ficticia. Y no quisiera arrebatarte este momento tan especial, pero no nos engañemos, esto no significa nada.<br><br>No dejes de estudiar, porque el próximo parcial podría ser tu perdición.", "leftOption": "Fin", "rightOption": "Fin", "image": "promocion.jfif"}, {"id": "regulariza-ending", "description": "Regularizaste.<br><br>Lo has logrado, has superado los requisitos mínimos. Aunque la satisfacción no sea abrumadora, reconoces que podrías haberlo hecho peor. Y eso es algo, ¿no?<br><br>Pero surge la pregunta: si esto te resultó difícil, ¿qué te depara el examen final? Así que recuerda que, incluso en la victoria, persiste el sufrimiento.", "leftOption": "Fin", "rightOption": "Fin", "image": "regulariza.jfif"}, {"id": "recursa-ending", "description": "Recursaste.<br><br>La decepción te inunda, y sientes que el mundo se desmorona a tu alrededor. Es un golpe bajo, una derrota amarga que se suma a la lista.<br><br>La luz al final del túnel parece apagarse, y tu futuro profesional continúa alejándose. Pero no te rindas por completo. Aunque, siendo honestos, las esperanzas de recuperación son escasas.", "leftOption": "Fin", "rightOption": "Fin", "image": "recursa.jfif"}, {"id": "exament-ending", "description": "Al evitar el examen, has cerrado una puerta importante en tu vida académica. El arrepentimiento y la insatisfacción te acompañarán como sombras constantes, recordándote las oportunidades que dejaste pasar.", "leftOption": "Fin", "rightOption": "Fin", "image": "mono.jfif"}, {"id": "juego-0-sueno", "description": "Despierta, era todo un sueño. Vuelves a la realidad en un día crucial, la presentación de tu videojuego ante el profesor y tus compañeros está a la vuelta de la esquina. La ansiedad se mezcla con la excitación mientras te preparas para el evento.<br><br>Es hora de dirigirte a la facultad para enfrentar la crítica y demostrar el fruto de tu esfuerzo.", "leftOption": "¡Qué nervios!", "rightOption": "¡Qué paja!", "image": "cama-dia.jfif"}, {"id": "juego-0", "description": "Abres los ojos en un día que sabes que será crucial. La presentación de tu videojuego ante el profesor y tus compañeros está a la vuelta de la esquina. La ansiedad se mezcla con la excitación mientras te preparas para el evento.<br><br>Es hora de dirigirte a la facultad para enfrentar la crítica y demostrar el fruto de tu esfuerzo.", "leftOption": "¡Qué nervios!", "rightOption": "¡Qué paja!", "image": "cama-dia.jfif"}, {"id": "final-juego-0", "description": "Mientras avanzas por los pasillos sombríos de la facultad, un escalofrío gélido serpentea por tu espalda. El silencio abrumador es casi palpable. Te adentras con determinación en el pasillo en dirección al aula 8, tu corazón martillea en tus oídos, mientras la sensación de que no estás a salvo en este lugar se cierne sobre ti.", "leftOption": "...", "rightOption": "...", "image": "facu-pasillo.jfif"}, {"id": "final-juego-1", "description": "Dentro del aula, una sombra siniestra se alza y toma forma: es el profesor de Paradigmas de la Programación, una figura aterradora que envuelve la sala en una atmósfera helada. A tu lado, tu amigo Fede comparte tu inquietud. El pánico se apodera de ti mientras te enfrentas a la macabra visión del profesor y te preguntas qué pesadilla se desencadenará a continuación.<br><br>Luego de un inquietante silencio, el profesor finalmente decide hablar. Con una sonrisa forzada, saluda a la clase: \"Muy buenas tardes a todos\". Sus palabras, aunque parecen amables, no te reconfortan. Sabes que las actividades están a punto de comenzar, y la incertidumbre de lo que se avecina te llena de temor.", "leftOption": "...", "rightOption": "...", "image": "profe-0.jfif"}, {"id": "final-juego-2", "description": "Luego de su inquietante saludo, el profesor se vuelve hacia tu camarada, Fede. Con tono enigmático, le dice: \"Get ready\". Fede asiente, su rostro refleja una creciente preocupación. La tensión en el aula se vuelve palpable, y no sabes qué esperar a medida que la clase avanza.", "leftOption": "...", "rightOption": "...", "image": "fede-0.jfif"}, {"id": "final-juego-3", "description": "El profesor comienza a jugar y analizar minuciosamente el videojuego de Fede. Sus ojos se mantienen fijos en la pantalla, y su concentración es palpable en todo el aula.", "leftOption": "...", "rightOption": "...", "image": "profe-1.jfif"}, {"id": "final-juego-4", "description": "El profesor se adentra en el juego con una intensidad que resulta inquietante. Su nivel de involucramiento en la partida es impresionante, incluso llegando a ser preocupante. La tensión en el aula sigue en aumento mientras observas esta extraña dinámica.", "leftOption": "...", "rightOption": "...", "image": "profe-5.jfif"}, {"id": "final-juego-5", "description": "El profesor continúa jugando, y su nivel de concentración es tal que parece haberse olvidado de la existencia de todo lo que lo rodea.<br><br>Finalmente, el miedo de Fede se convierte en terror, cuando el profesor, en un trágico accidente, presiona el botón de reset. \"Una adición inofensiva\", había supuesto Fede. Las consecuencias de su error son catastróficas. Ahora, el profesor se enfrenta a la pérdida de todo su progreso.", "leftOption": "...", "rightOption": "...", "image": "fede-1.jfif"}, {"id": "final-juego-6", "description": "El profesor no se contiene en lo absoluto. Comienza a maldecir al juego y su desafortunado creador. La situación resulta un tanto cómica. Pero no para Fede, cuyo rostro refleja una desesperación incontrolable.", "leftOption": "...", "rightOption": "...", "image": "profe-3.jfif"}, {"id": "final-juego-7", "description": "El profesor, en medio de su frenesí, hace un llamado por ese tal Fede, el causante de la reciente catástrofe. Quien huye despavorido sin mirar atrás.<br><br>Ahora estás a solas con el profesor.", "leftOption": "...", "rightOption": "...", "image": "fede-2.jfif"}, {"id": "final-juego-8", "description": "El profesor se vuelve hacia ti, y te grita: \"¡Dale! ¡Daleee!\", impaciente de probar tu juego. Su voz resuena en el silencio del aula, haciendo eco en tus oídos. Tu corazón se acelera, y la adrenalina recorre tu cuerpo. No tienes más opciones que obedecer.", "leftOption": "...", "rightOption": "...", "image": "profe-3.jfif"}, {"id": "final-juego-9", "description": "El profesor comienza a jugar tu videojuego. Observas con nerviosismo mientras evalúa cada elemento, cada decisión que tomaste durante su creación.", "leftOption": "...", "rightOption": "...", "image": "profe-2.jfif"}, {"id": "final-juego-10", "description": "Cada clic y movimiento del mouse son evaluados minuciosamente por el profesor. Las mecánicas del juego, aunque imperfectas, parecen captar su atención. No puedes evitar experimentar una mezcla de nerviosismo y anticipación mientras observas su reacción. ¿Habrá cumplido tu juego con sus expectativas? El destino de tu carrera y tu reputación están en juego.", "leftOption": "...", "rightOption": "...", "image": "profe-1.jfif"}, {"id": "promocion-juego", "description": "Sorprendentemente, el profesor comienza a alabar a tu juego. Parece estar disfrutando la experiencia jugable.<br><br>Este momento de validación alimenta la llama de tu pasión por la programación. Te sumerges en la incertidumbre de la evaluación del profesor, consciente de que cada línea de código es una expresión de tu habilidad y dedicación.", "leftOption": "...", "rightOption": "...", "image": "profe-5.jfif"}, {"id": "promocion-juego-ending", "description": "Promocionaste.<br><br>Tu sorpresa se mezcla con una oleada de gratificación. Con un juego tan sencillo, obtener la aprobación del profesor es un logro que no esperabas. Y mucho menos, promocionar la materia.<br><br>Pero no te equivoques, el criterio del profesor está lejos de ser objetivo. Aún hay varios aspectos que podrían haber sido mejorados: desde la elección de algoritmos hasta la falta de optimización en el código. Está claro que tu juego es obra de un principiante y que todavía tienes mucho por aprender.", "leftOption": "Fin", "rightOption": "Fin", "image": "promocion.jfif"}, {"id": "regulariza-juego", "description": "El miedo te invade. No tienes nada para mostrar. Tu juego no existe. ¿Qué vas a hacer ahora? ¿Cómo vas a enfrentar al profesor? ¿Qué excusa vas a dar?<br><br>El pánico te paraliza, congelando cada pensamiento y acción. Te quedas inmóvil, como si el simple hecho de no moverte pudiera detener el inexorable avance del tiempo. Pero no hay escape.", "leftOption": "...", "rightOption": "NADA es un juego", "image": "profe-4.jfif"}, {"id": "regulariza-juego-ending", "description": "Regularizaste.<br><br>El profesor, de alguna manera inexplicable, valora tu decisión de no hacer nada y, para tu sorpresa, te concede la aprobación.<br><br>La incredulidad te embarga. ¿Cómo es posible que un profesor apruebe a un estudiante que aparentemente no hizo nada? ¿Qué clase de final es este?<br><br>En este momento de perplejidad, surge la reflexión. ¿Es un reconocimiento irónico de la realidad académica, o hay un mensaje más profundo sobre la importancia de las decisiones y sus consecuencias?<br><br>Para pensar, señores.", "leftOption": "Fin", "rightOption": "Fin", "image": "regulariza.jfif"}, {"id": "recursa-juego-raycasting", "description": "Tu juego presenta notables problemas de rendimiento. La experiencia de juego es prácticamente insoportable, y el profesor no oculta su insatisfacción.<br><br>La apuesta arriesgada que hiciste parece tener consecuencias, y la incertidumbre sobre la evaluación futura de tu trabajo nubla el horizonte.", "leftOption": "...", "rightOption": "...", "image": "profe-6.jfif"}, {"id": "recursa-juego-mono", "description": "La tensión en la sala aumenta a medida que el profesor intenta jugar tu juego, solo para encontrarse con un nivel de dificultad que claramente está más allá de su destreza. La frustración crece a medida que no logra superar los obstáculos iniciales, y su reacción es visceral. Gritos de irritación y golpes en el teclado revelan su creciente disgusto.", "leftOption": "...", "rightOption": "...", "image": "profe-3.jfif"}, {"id": "recursa-juego-ending", "description": "Recursaste.<br><br>La experiencia del profesor con tu juego ha sido más que decepcionante.<br><br>Te enfrentas a la dura realidad de que, a veces, la ambición puede ser tu propia perdición. Ahora, la única opción es prepararte para el próximo intento y reconsiderar tu enfoque. La recursada se presenta como un recordatorio de que el éxito no es garantizado por el esfuerzo, mientras que, por otro lado, tomar una desición incorrecta garantiza el fracaso.", "leftOption": "Fin", "rightOption": "Fin", "image": "recursa.jfif"}, {"id": "to-be-continued", "description": "To be continued...", "leftOption": "Dale, no pasa nada", "rightOption": "¡Qué manga de vagos!", "image": "black.jpg"}, {"id": "creditos", "description": "Juego hecho, realizado y efectuado por:<br><br>Joaquin Terzano<br><br>Mariano Baldovino<br><br>Guillermo Salaberry<br><br><br>Con el apoyo, la asistencia y colaboración de:<br><br>ChatGPT<br><br>BingIA<br><br>GitHubCopilot<br><br>John Loquendo<br><br>elxokas<br><br>DrossRotzank", "leftOption": "Ta bueno", "rightOption": "Juegazo", "image": "end.jfif"}, {"id": "mono-instrucciones", "description": "\"El mono loco\"<br><br>Instrucciones del juego:<br><br>Movimiento con las teclas \"a\" y \"d\".<br><br>Atrapa mates y bananas. Evita el café.<br><br>Banana: 2 puntos<br><br>Mate: 4 puntos<br><br>Café: -15 puntos", "leftOption": "Empezar", "rightOption": "Empezar, no te queda otra", "image": "mono-vivo.jfif"}, {"id": "mono-muerto-0", "description": "Game Over<br><br>El mono murió de sobredosis de café.<br><br>Puede que tu juego sea demasiado difícil.", "leftOption": "No me la contes", "rightOption": "Sorry mono", "image": "mono-muerto.jfif"}, {"id": "mono-muerto-1", "description": "Ganaste<br><br>El mono murió por tomar mate con banana. El estómago le explotó. ¿Qué esperabas? ¿Un final feliz?<br><br>Felicidades, tu juego es demasiado fácil.", "leftOption": "Pobrecito", "rightOption": "¡Que se joda!", "image": "mono-muerto.jfif"}]